group-reports/shahriar-1-2-tests/first-results/disk-throughput-tuning-protocol-A-sndbuf-2M/test-1.txt
read-sequentially-test-job: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 process
read-sequentially-test-job: Laying out IO file (1 file / 10240MiB)

read-sequentially-test-job: (groupid=0, jobs=1): err= 0: pid=31224: Sat Jul  8 12:16:34 2023
   read: IOPS=5, BW=22.9MiB/s (24.0MB/s)(13.5GiB/602747msec)
    slat (usec): min=87, max=22020, avg=395.79, stdev=659.82
    clat (msec): min=74, max=5299, avg=2793.96, stdev=165.30
     lat (msec): min=77, max=5299, avg=2794.35, stdev=165.12
    clat percentiles (msec):
     |  1.00th=[ 2601],  5.00th=[ 2668], 10.00th=[ 2702], 20.00th=[ 2769],
     | 30.00th=[ 2769], 40.00th=[ 2802], 50.00th=[ 2802], 60.00th=[ 2802],
     | 70.00th=[ 2802], 80.00th=[ 2836], 90.00th=[ 2869], 95.00th=[ 2903],
     | 99.00th=[ 2970], 99.50th=[ 3104], 99.90th=[ 4799], 99.95th=[ 5067],
     | 99.99th=[ 5269]
   bw (  KiB/s): min= 8192, max=49152, per=99.93%, avg=23428.63, stdev=4533.88, samples=1200
   iops        : min=    2, max=   12, avg= 5.48, stdev= 1.17, samples=1200
  lat (msec)   : 100=0.03%, 250=0.03%, 500=0.03%, 750=0.03%, 1000=0.06%
  cpu          : usr=0.03%, sys=0.22%, ctx=3465, majf=0, minf=14863
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=99.6%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3450,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=22.9MiB/s (24.0MB/s), 22.9MiB/s-22.9MiB/s (24.0MB/s-24.0MB/s), io=13.5GiB (14.5GB), run=602747-602747msec

Disk stats (read/write):
    drbd1: ios=18762/6, merge=0/0, ticks=52048716/808, in_queue=52049524, util=100.00%, aggrios=18762/9, aggrmerge=0/0, aggrticks=52062762/808, aggrin_queue=52063570, aggrutil=100.00%
    dm-0: ios=18762/9, merge=0/0, ticks=52062762/808, in_queue=52063570, util=100.00%, aggrios=18762/9, aggrmerge=0/0, aggrticks=52063879/809, aggrin_queue=52055264, aggrutil=100.00%
  vdb: ios=18762/9, merge=0/0, ticks=52063879/809, in_queue=52055264, util=100.00%